{
	"inc": "<stdlib.h>",
	"dscrp": "Для выполнения множества операций, включая конвертацию, генерацию псевдослучайных чисел, выделение памяти, контроль процессов, окружения, сигналов, поиска и сортировки.",
	"ver": "",
	"lex": {
		"СтрокаВЦелое": {
			"ver": "C89",
			"org": "atoi",
			"call_org": "",
			"call": "",
			"dscrp": "Строка в число двойной точности (%double%; НЕ %float%)",
			"demo": ""
		},
		"СтрокаВДробноеХ2": {
			"ver": "C89",
			"org": "atof",
			"call_org": "",
			"call": "",
			"dscrp": "Строка в целое число (%int%)",
			"demo": ""
		},
		"СтрокаВДлинноеЦелое": {
			"ver": "C89",
			"org": "atol",
			"call_org": "",
			"call": "",
			"dscrp": "Строка в длинное целое число (%long% %int%)",
			"demo": ""
		},
		"СтрокаВДлидлинноеЦелое": {
			"ver": "C99",
			"org": "atoll",
			"call_org": "",
			"call": "",
			"dscrp": "Строка в длинное целое число (%long% %long% %int%)",
			"demo": ""
		},
		"СтрокаВДробноеХ2А": {
			"ver": "C89",
			"org": "strtod",
			"call_org": "",
			"call": "",
			"dscrp": "Строка в число двойной точности (%double%)",
			"demo": ""
		},
		"СтрокаВДробное": {
			"ver": "C99",
			"org": "strtof",
			"call_org": "",
			"call": "",
			"dscrp": "Строка в число одиночной точности (%float%)",
			"demo": ""
		},
		"СтрокаВДлинноеЦелоеА": {
			"ver": "C89",
			"org": "strtol",
			"call_org": "",
			"call": "",
			"dscrp": "Строка в длинное целое число (%long% %int%)",
			"demo": ""
		},
		"СтрокаВДлинноеДробноеХ2": {
			"ver": "C99",
			"org": "strtold",
			"call_org": "",
			"call": "",
			"dscrp": "Строка в длинное двойной точности (%long% %double%)",
			"demo": ""
		},
		"СтрокаВДлидлинноеЦелоеА": {
			"ver": "C99",
			"org": "strtoll",
			"call_org": "",
			"call": "",
			"dscrp": "Строка в длинное целое число (%long% %long% %int%)",
			"demo": ""
		},
		"СтрокаВДлинноеЦелоеБеззнака": {
			"ver": "C89",
			"org": "strtoul",
			"call_org": "",
			"call": "",
			"dscrp": "Строка в беззнаковое длинное целое число (%unsigned% %long% %int%)",
			"demo": ""
		},
		"СтрокаВДлидлинноеЦелоеБеззнака": {
			"ver": "C99",
			"org": "strtoull",
			"call_org": "",
			"call": "",
			"dscrp": "Строка в беззнаковое длинное целое число (%unsigned% %long% %long% %int%)",
			"demo": ""
		},
		"СлучайноеЧисло": {
			"ver": "C89",
			"org": "rand",
			"call_org": "",
			"call": "",
			"dscrp": "Генерирует псевдослучайное значение",
			"demo": ""
		},
		"СлучайноеЧислоНачЗнач": {
			"ver": "C89",
			"org": "srand",
			"call_org": "",
			"call": "",
			"dscrp": "Устанавливает начальное значение генератора псевдослучайных чисел",
			"demo": ""
		},
		"ВыделитьПамять": {
			"ver": "C89",
			"org": "malloc",
			"call_org": "",
			"call": "",
			"dscrp": "Выделить память из кучи",
			"demo": ""
		},
		"ВыделитьПамятьЧистой": {
			"ver": "C89",
			"org": "calloc",
			"call_org": "",
			"call": "",
			"dscrp": "Выделить память из кучи",
			"demo": ""
		},
		"ВыделитьПамятьПерераспределением": {
			"ver": "C89",
			"org": "realloc",
			"call_org": "",
			"call": "",
			"dscrp": "Выделить память из кучи",
			"demo": ""
		},
		"ОсвободитьПамять": {
			"ver": "C89",
			"org": "free",
			"call_org": "",
			"call": "",
			"dscrp": "Освобождает память обратно в кучу",
			"demo": ""
		},
		"ПрерватьРаботуПрограммы": {
			"ver": "C89",
			"org": "abort",
			"call_org": "",
			"call": "",
			"dscrp": "Некорректное завершение выполнения",
			"demo": ""
		},
		"РегистрацияФункцииПередЗавершениемПрограммы": {
			"ver": "C89",
			"org": "atexit",
			"call_org": "",
			"call": "",
			"dscrp": "Регистрирует обратный вызов функции, которую нужно будет выполнить перед завершением работы программы",
			"demo": ""
		},
		"ЗавершитьРаботуПрограммы": {
			"ver": "C89",
			"org": "exit",
			"call_org": "",
			"call": "",
			"dscrp": "Завершает выполнение программы",
			"demo": ""
		},
		"ПолучитьПеременнуюСистемы": {
			"ver": "C89",
			"org": "getenv",
			"call_org": "",
			"call": "",
			"dscrp": "Извлекает переменные окружения",
			"demo": ""
		},
		"ВыполнитьВнешнююКоманду": {
			"ver": "C89",
			"org": "system",
			"call_org": "",
			"call": "",
			"dscrp": "Выполняет внешнюю команду",
			"demo": ""
		},
		"ДвоичныйПоискВМассиве": {
			"ver": "C89",
			"org": "bsearch",
			"call_org": "",
			"call": "",
			"dscrp": "Двоичный поиск в массиве",
			"demo": ""
		},
		"СортироватьМассив": {
			"ver": "C89",
			"org": "qsort",
			"call_org": "",
			"call": "",
			"dscrp": "Сортировка массива",
			"demo": ""
		},
		"МодульЦелого": {
			"ver": "C89",
			"org": "abs",
			"call_org": "",
			"call": "",
			"dscrp": "Абсолютная величина целого числа",
			"demo": ""
		},
		"МодульДлинногоЦелого": {
			"ver": "C89",
			"org": "labs",
			"call_org": "",
			"call": "",
			"dscrp": "Абсолютная величина целого числа",
			"demo": ""
		},
		"МодульДлидлинногоЦелого": {
			"ver": "C99",
			"org": "llabs",
			"call_org": "",
			"call": "",
			"dscrp": "Абсолютная величина целого числа",
			"demo": ""
		},
		"МодульМаксимальногоЦелого": {
			"ver": "C99",
			"org": "imaxabs",
			"call_org": "",
			"call": "",
			"dscrp": "Абсолютная величина целого числа",
			"demo": ""
		},
		"ДелениеЦелого": {
			"ver": "C89",
			"org": "div",
			"call_org": "",
			"call": "",
			"dscrp": "Деление целых чисел",
			"demo": ""
		},
		"ДелениеДлинногоЦелого": {
			"ver": "C89",
			"org": "ldiv",
			"call_org": "",
			"call": "",
			"dscrp": "Деление целых чисел",
			"demo": ""
		},
		"ПолучитьДлинуМнБайтСимвола": {
			"ver": "C99",
			"org": "mblen",
			"call_org": "",
			"call": "",
			"dscrp": "Размер многобайтовых символов",
			"demo": ""
		},
		"МнБайтСимволВШирСимвол": {
			"ver": "C99",
			"org": "mbtowc",
			"call_org": "",
			"call": "",
			"dscrp": "Преобразование многобайтовых и широких символов",
			"demo": ""
		},
		"ШирСимволВМнБайтСимвол": {
			"ver": "C99",
			"org": "wctomb",
			"call_org": "",
			"call": "",
			"dscrp": "Преобразование многобайтовых и широких символов",
			"demo": ""
		},
		"МнБайтСтрокаВШирСтрока": {
			"ver": "C99",
			"org": "mbstowcs",
			"call_org": "",
			"call": "",
			"dscrp": "Преобразование многобайтовых и широких символов",
			"demo": ""
		},
		"ШирСтрокаВМнБайтСтрока": {
			"ver": "C99",
			"org": "wcstombs",
			"call_org": "",
			"call": "",
			"dscrp": "Преобразование многобайтовых и широких символов",
			"demo": ""
		},
		"ПУСТОЙ": {
			"ver": "",
			"org": "NULL",
			"call_org": "",
			"call": "",
			"dscrp": "Макрос, расширяющий константу нулевого указателя; то есть константу, представляющую значение указателя, гарантированно указывающего несуществующий адрес объекта в памяти",
			"demo": ""
		},
		"пРазм": {
			"ver": "C89",
			"org": "size_t",
			"call_org": "",
			"call": "",
			"dscrp": "Представления размера объекта",
			"demo": ""
		},
		"пДелЦел": {
			"ver": "C89",
			"org": "div_t",
			"call_org": "",
			"call": "",
			"dscrp": "",
			"demo": ""
		},
		"пДелДлиЦел": {
			"ver": "C89",
			"org": "ldiv_t",
			"call_org": "",
			"call": "",
			"dscrp": "",
			"demo": ""
		},
		".частное": {
			"ver": "C89",
			"org": ".quot",
			"call_org": "",
			"call": "",
			"dscrp": "",
			"demo": ""
		},
		".остаток": {
			"ver": "C89",
			"org": ".rem",
			"call_org": "",
			"call": "",
			"dscrp": "",
			"demo": ""
		}
	}
}

		