{
	"inc": "<time.h>",
	"dscrp": "Для конвертации между различными форматами времени и даты.",
	"ver": "",
	"lex": {

		"ПроцессорноеВремя": {
			"ver": "",
			"org": "clock",
			"call_org": "clock_t clock(void)",
			"call": "",
			"dscrp": "Возвращает время, измеряемое процессором в тактах от начала выполнения программы, или −1, если оно не известно. Пересчет этого времени в секунды выполняется по формуле: %clock%() / %CLOCKS_PER_SEC%",
			"demo": ""
		},

		"ТекущееВремя": {
			"ver": "",
			"org": "time",
			"call_org": "time_t time(time_t* tp)",
			"call": "",
			"dscrp": "Возвращает текущее календарное время или −1, если это время не известно. Если указатель 'tp' не равен %NULL%, то возвращаемое значение записывается также и в 'tp'",
			"demo": ""
		},

		"РазностьВремени": {
			"ver": "",
			"org": "difftime",
			"call_org": "double difftime(time_t time2, time_t time1)",
			"call": "",
			"dscrp": "Возвращает разность 'time2'-'time1', выраженную в секундах",
			"demo": ""
		},

		"ПреобразаватьВремя": {
			"ver": "",
			"org": "mktime",
			"call_org": "time_t mktime(struct tm* tp)",
			"call": "",
			"dscrp": "Преобразует местное время, заданное структурой 'tp', в календарное и возвращает его в том же виде, что и функция %time%. Компоненты структуры будут иметь значения в указанных выше диапазонах. Функция возвращает календарное время или −1, если оно не представимо.",
			"demo": ""
		},

		"ПреобразаватьВремяВСтроку": {
			"ver": "",
			"org": "asctime",
			"call_org": "char* asctime(const struct tm* tp)",
			"call": "",
			"dscrp": "Преобразует время из структуры 'tp' в строку вида -=Sun Jan 3 15:14:13 1988\n\0=-",
			"demo": ""
		},

		"ТАКТЫ_В_СЕКУНДУ": {
			"ver": "",
			"org": "CLOCKS_PER_SEC",
			"call_org": "",
			"call": "",
			"dscrp": "Определяет количество тактов системных часов в секунду. Используется для пересчета величины, возвращаемой функцией %clock%, в секунды",
			"demo": ""
		},

		"ТКТ_В_СЕК": {
			"ver": "",
			"org": "CLK_PER_SEC",
			"call_org": "",
			"call": "",
			"dscrp": "Альтернативное имя константы %CLOCKS_PER_SEC%, используемое в некоторых библиотеках",
			"demo": ""
		},

		"ТКТ_В_СЕК_Х2": {
			"ver": "",
			"org": "CLK_TCK",
			"call_org": "",
			"call": "",
			"dscrp": "Вышедший из употребления макрос для константы %CLOCKS_PER_SEC%",
			"demo": ""
		},

		"пВремяТакт": {
			"ver": "",
			"org": "clock_t",
			"call_org": "",
			"call": "",
			"dscrp": "Возвращается функцией %clock%. Обычно определён как %int% или %long% %int%",
			"demo": ""
		},

		"пВремя": {
			"ver": "",
			"org": "time_t",
			"call_org": "",
			"call": "",
			"dscrp": "Возвращается функцией %time%. Обычно определён как %int% или %long% %int%",
			"demo": ""
		},

		"пКлВремя": {
			"ver": "",
			"org": "tm",
			"call_org": "",
			"call": "",
			"dscrp": "Структура содержащее компоненты календарного времени. Нелинейное, дискретное календарное представление времени.",
			"demo": ""
		},

		".секунда": {
			"ver": "",
			"org": ".tm_sec",
			"call_org": "int tm_sec",
			"call": "",
			"dscrp": "Секунды от начала минуты - [0,60]",
			"demo": ""
		},

		".минута": {
			"ver": "",
			"org": ".tm_min",
			"call_org": "int tm_min",
			"call": "",
			"dscrp": "Минуты от начала часа - [0,59]",
			"demo": ""
		},

		".час": {
			"ver": "",
			"org": ".tm_hour",
			"call_org": "int tm_hour",
			"call": "",
			"dscrp": "Часы от полуночи - [0,23]",
			"demo": ""
		},

		".день": {
			"ver": "",
			"org": ".tm_mday",
			"call_org": "int tm_mday",
			"call": "",
			"dscrp": "Число месяца - [1,31]",
			"demo": ""
		},

		".месяц": {
			"ver": "",
			"org": ".tm_mon",
			"call_org": "int tm_mon",
			"call": "",
			"dscrp": "Месяцы после января - [0,11]",
			"demo": ""
		},

		".год": {
			"ver": "",
			"org": ".tm_year",
			"call_org": "int tm_year",
			"call": "",
			"dscrp": "Года с 1900",
			"demo": ""
		},

		".деньнедели": {
			"ver": "",
			"org": ".tm_wday",
			"call_org": "int tm_wday",
			"call": "",
			"dscrp": "Дни с воскресенья - [0,6]",
			"demo": ""
		},

		".деньгода": {
			"ver": "",
			"org": ".tm_yday",
			"call_org": "int tm_yday",
			"call": "",
			"dscrp": "Дни с первого января - [0,365]",
			"demo": ""
		},

		".летнеевремя": {
			"ver": "",
			"org": ".tm_isdst",
			"call_org": "int tm_isdst",
			"call": "",
			"dscrp": "Признак летнего времени",
			"demo": ""
		}
	}
}